-- объявление переменной
declare @a int, @b int
set @a = 23
select @a = 3, @b = 5
select @a kolvo
print @a

-- условный оператор
if(@a + @b = 7)
begin
	print 'YES!'
end
else print 'NO!'

-- цикл
declare @i int = 1
while(@i <= 5)
begin
	select @i
	set @i+=1
end

-- хранимые процедуры
alter procedure show_authors(@st varchar(2), @contr int)
as
begin
	select * from authors 
	where state = @st and contract = @contr
end

drop procedure show_authors

exec show_authors 'UT', 1

-- ДЗ

-- Театр
/*
1. Название спектакля	+
2. ФИО актёра	+
3. ФИО режиссёра	+
4. ФИО сценариста	+
5. Цена билета	+
6. Название роли	+
7. № места
8. Тип места (балкон, амфитеатр)	+
9. Дата спектакля	+
10. Ставка актёра за спектакль	+
11. Длительность спектакля	+
12. Адрес актёра	+
13. Время начала сеанса	+
14. Дата сеанса	+
15. Название реквизита	+
16. Стоимость реквизита	+
*/

-- ДЗ от 25.12.20
-- 1. Хранимая процедура принимает штат и показывает книги, написанные авторами из этого штата
-- 2. Хранимая процедура принимает неообходимые параметры и добавляет автора
-- 3. Хранимая процедура принимает название книги и удаляет все книги с таким названием
-- 4. Хранимая процедура принимает жанр и сумму и увеиличивает цену всех книг этого жанра на указанную сумму